package characters

import "fmt"

var Gifts = []Gift{
	{1, "Острый соус", 1, 2, 0},
	{2, "Протеиновый батончик", 2, 3, 0},
	{3, "Взрывной брелок", 3, 1, 0},
	{4, "Комикс про героев", 1, 2, 0},
	{5, "Тренировочные перчатки", 4, 4, 0},
	{6, "Сладости", -1, 0, 3},
	{7, "Милый плюш", -2, 0, 5},
	{8, "Гантели", 2, 3, 0},
	{9, "Форма UA", 3, 5, 0},
	{10, "Энергетик", 1, 1, 1},
	{11, "Наушники", 2, 2, 0},
	{12, "Манга", 1, 1, 0},
	{13, "Боевые ботинки", 4, 4, 0},
	{14, "Талисман", 1, 1, 0},
	{15, "Медаль", 3, 6, 0},
	{16, "Плакат All Might", 2, 2, 0},
	{17, "Тактический пояс", 3, 3, 0},
	{18, "Фляга", 1, 1, 0},
	{19, "Бинты", 2, 2, 0},
	{20, "Перчатки", 3, 3, 0},
	{21, "Шоколад", -1, 0, 2},
	{22, "Фейерверк", 2, 1, 1},
	{23, "Сувенир", 1, 1, 0},
	{24, "Кольцо", 5, 3, 2},
	{25, "Письмо", 6, 2, 3},
}

func GiveGiftMenu(b *Bakugo) {
	fmt.Println("\nВыбери подарок:")

	for _, g := range Gifts {
		fmt.Printf("%d. %s\n", g.ID, g.Name)
	}

	var choice int
	fmt.Print("> ")
	fmt.Scanln(&choice)

	for _, g := range Gifts {
		if g.ID == choice {
			b.ReceiveGift(g)
			fmt.Println("Ты подарил:", g.Name)
			return
		}
	}
}